<?php

$lang['required']			= "Поле %s обязательно для заполнения.";
$lang['isset']				= "Поле %s должно иметь значение.";
$lang['valid_email']		= "Поле %s должно содержать адрес электронной почты.";
$lang['valid_emails']		= "Поле %s должно содержать все действующие адреса электронной почты.";
$lang['valid_url']			= "Поле %s должно содержать корректный URL.";
$lang['valid_ip']			= "Поле %s должно содержать корректный IP.";
$lang['min_length']			= "Поле %s должно быть не менее %s символов длиной.";
$lang['max_length']			= "Поле %s не может превышать символов %s длиной.";
$lang['exact_length']		= "Поле %s должно быть символов точно %s длиной.";
$lang['alpha']				= "Поле %s может содержать только буквенные символы.";
$lang['alpha_numeric']		= "Поле %s может содержать только буквенно-цифровых символов.";
$lang['alpha_dash']			= "Поле %s может содержать только буквенно-цифровые символы, подчеркивания и тире.";
$lang['numeric']			= "Поле %s должно содержать только цифры.";
$lang['is_numeric']			= "Поле %s должно содержать только цифры.";
$lang['integer']			= "Поле %s должно содержать целое число.";
$lang['regex_match']		= "Поле %s не в правильном формате.";
$lang['matches']			= "Поле %s не соответствует полю %s ниже.";
$lang['is_natural']			= "Поле %s должно содержать только положительные числа.";
$lang['is_natural_no_zero']	= "Поле %s должно содержать число больше нуля.";
$lang['decimal']			= "Поле %s должно содержать десятичное число.";
$lang['less_than']			= "Поле %s должно содержать число, меньшее, чем %s.";
$lang['greater_than']		= "Поле %s должно содержать число, большее %s.";
$lang['_unique_email']		= "Такой e-mail уже зарегистрирован.";
$lang['is_unique']		    = "Такой e-mail уже зарегистрирован.";
$lang['_exist_email']		= "Такой e-mail не зарегистрирован.";
$lang['_activate_account']	= "Акаунт не активирован.";
$lang['_captcha']	        = "Ошибка.";
$lang['_tel']	            = "Укажите правильный номер телефона";
$lang['_check_fio']	        = "Поле %s может содержать только буквы";


/* End of file form_validation_lang.php */
/* Location: ./system/language/english/form_validation_lang.php */
